ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sdh.c
/**
  ******************************************************************************
  * @file    bl606p_sdh.c
  * @version V1.2
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p.h"
#include "string.h"
#include "bl606p_sdh.h"
#include "bflb_platform.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  SDH
 *  @{
 */

/** @defgroup  SDH_Private_Macros
 *  @{
 */

/*@} end of group SDH_Private_Macros */

/** @defgroup  SDH_Private_Types
 *  @{
 */

/*@} end of group SDH_Private_Types */

/** @defgroup  SDH_Private_Variables
 *  @{
 */
static uint32_t bootDummy = 0;
static SDH_Handle_Cfg_Type *sdhHandle = NULL;

/*@} end of group SDH_Private_Variables */

/** @defgroup  SDH_Global_Variables
 *  @{
 */

/*@} end of group SDH_Global_Variables */

/** @defgroup  SDH_Private_Fun_Declaration
 *  @{
 */
#if (defined BOOTROM) || (!defined BFLB_USE_HAL_DRIVER)
static void SDH_IntHandler(IRQn_Type intPeriph, SDH_Handle_Cfg_Type *handle);
#endif

/*@} end of group SDH_Private_Fun_Declaration */

/** @defgroup  SDH_Private_Functions
 *  @{
 */

/*@} end of group SDH_Private_Functions */

/** @defgroup  SDH_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Enable SDH DMA
 *
 * @param  dmaMode: DMA mode select
 *
 * @return None
 *
*******************************************************************************/
void SDH_EnableDMA(SDH_DMA_Mode_Type dmaMode)
{
    uint16_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SDH_DMA_MODE_TYPE(dmaMode));

    /* Select DMA type */
    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_HOST_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_DMA_SEL, dmaMode);
    BL_WR_REG16(SDH_BASE, SDH_SD_HOST_CTRL, tmpVal);

    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE);
    tmpVal = BL_SET_REG_BIT(tmpVal, SDH_DMA_EN);
    BL_WR_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Disable SDH DMA
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_DisableDMA(void)
{
    uint16_t tmpVal;

    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_DMA_EN);
    BL_WR_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE, tmpVal);
}
/****************************************************************************/ /**
 * @brief  SDH enable interrupt
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_ITConfig(uint32_t SDH_IT_FLAG, BL_Fun_Type NewState)
{
    if (NewState != DISABLE) {
        /* Enable the SDH interrupts */
        SDH_EnableIntSource(SDH_IT_FLAG);
    } else {
        /* Disable the SDH interrupts */
        SDH_DisableIntSource(SDH_IT_FLAG);
    }
}
/****************************************************************************/ /**
 * @brief  SDH enable interrupt
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void SDH_EnableStatus(void)
{
    uint32_t tmpVal;

    /* Disable all interrupts */
    SDH_DisableIntStatus(SDH_INT_ALL);

    tmpVal = (SDH_INT_CMD_TIMEOUT | SDH_INT_CMD_CRC_ERROR | SDH_INT_CMD_ENDBIT_ERROR |
              SDH_INT_CMD_INDEX_ERROR | SDH_INT_CMD_COMPLETED |
              SDH_INT_CARD_INSERT | SDH_INT_CARD_REMOVE |
              SDH_INT_DATA_COMPLETED | SDH_INT_DMA_COMPLETED |
              SDH_INT_BUFFER_WRITE_READY | SDH_INT_BUFFER_READ_READY |
              SDH_INT_DATA_TIMEOUT | SDH_INT_DATA_CRC_ERROR | SDH_INT_DATA_ENDBIT_ERROR |
              SDH_INT_AUTO_CMD12_ERROR | SDH_INT_DMA_ERROR | SDH_INT_BLK_GAP_EVENT |
              SDH_INT_RETUNE_EVENT | SDH_INT_TUNE_ERROR);

    SDH_EnableIntStatus(tmpVal);
}
/****************************************************************************/ /**
 * @brief  SDH enable interrupt
 *
 * @param  dataCfg: Transfer data config pointer
 *
 * @return SDH status
 *
*******************************************************************************/
SDH_Stat_Type SDH_ConfigDataTranfer(SDH_Data_Cfg_Type *dataCfg)
{
    uint16_t tmpVal;

    if (dataCfg != NULL) {
        /* For transfer boot continous, only need to set the CREQ bit */
        if (dataCfg->dataType == SDH_TRANS_DATA_BOOT_CONT) {
            tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_BLOCK_GAP_CTRL);
            /* Clear stop at block gap request */
            tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_STOP_AT_BLOCK_GAP_REQ);
            /* Continous transfer data */
            tmpVal = BL_SET_REG_BIT(tmpVal, SDH_CONT_REQ);
            BL_WR_REG16(SDH_BASE, SDH_SD_BLOCK_GAP_CTRL, tmpVal);

            return SDH_STAT_SUCCESS;
        }

        tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_PRESENT_STATE_1);

