ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sdh.c
        /* Check data inhibit flag */
        if (BL_IS_REG_BIT_SET(tmpVal, SDH_CMD_INHIBIT_DAT)) {
            return SDH_STAT_BUSY;
        }

        tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE);

        /* Check transfer block count */
        if ((dataCfg->blockCount > SDH_MAX_BLOCK_COUNT) || ((dataCfg->txData == NULL) && (dataCfg->rxData == NULL))) {
            return SDH_STAT_INVLAID_PARA;
        }

        if (dataCfg->rxData) {
            tmpVal = BL_SET_REG_BIT(tmpVal, SDH_TO_HOST_DIR);
        } else {
            tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_TO_HOST_DIR);
        }

        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_AUTO_CMD_EN, 0x00);

        /* auto command 23, auto send set block count cmd before multiple read/write */
        if (dataCfg->enableAutoCommand23) {
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_AUTO_CMD_EN, 0x02);
            BL_WR_REG(SDH_BASE, SDH_SD_SYS_ADDR_LOW, dataCfg->blockCount);
        } else if (dataCfg->enableAutoCommand12) {
            /* auto command 12 */
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_AUTO_CMD_EN, 0x01);
        }

        if (dataCfg->blockCount > 1U) {
            tmpVal = BL_SET_REG_BIT(tmpVal, SDH_MULTI_BLK_SEL);
        } else {
            tmpVal = BL_CLR_REG_BIT(tmpVal, SDH_MULTI_BLK_SEL);
        }

        /* Enable block count */
        tmpVal = BL_SET_REG_BIT(tmpVal, SDH_BLK_CNT_EN);

        BL_WR_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE, tmpVal);

        /* if transfer boot data, leave the block count to SDH_SetMmcBootConfig function */
        if (dataCfg->dataType != SDH_TRANS_DATA_BOOT) {
            /* config data block size/block count */
            BL_WR_REG16(SDH_BASE, SDH_SD_BLOCK_SIZE, dataCfg->blockSize);
            BL_WR_REG16(SDH_BASE, SDH_SD_BLOCK_COUNT, dataCfg->blockCount);
        }
    } else {
        /* clear data flags */
        tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_AUTO_CMD_EN, 0x00);
        BL_WR_REG16(SDH_BASE, SDH_SD_TRANSFER_MODE, tmpVal);

        tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_PRESENT_STATE_1);

        /* Check data inhibit flag */
        if (BL_IS_REG_BIT_SET(tmpVal, SDH_CMD_INHIBIT_CMD)) {
            return SDH_STAT_BUSY;
        }
    }

    return SDH_STAT_SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SDH enable interrupt
 *
 * @param  cmd: Transfer data config pointer
 *
 * @return SDH status
 *
*******************************************************************************/
SDH_Stat_Type SDH_GetCmdResp(SDH_CMD_Cfg_Type *cmd)
{
    if (cmd->respType != SDH_RESP_NONE) {
        cmd->response[0U] = BL_RD_REG(SDH_BASE, SDH_SD_RESP_0);
        cmd->response[1U] = BL_RD_REG(SDH_BASE, SDH_SD_RESP_2);
        cmd->response[2U] = BL_RD_REG(SDH_BASE, SDH_SD_RESP_4);
        cmd->response[3U] = BL_RD_REG(SDH_BASE, SDH_SD_RESP_6);
    }

    return SDH_STAT_SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SDH read data port
 *
 * @param  dataCfg: Transfer data config pointer
 *
 * @return Read length
 *
*******************************************************************************/
uint32_t SDH_ReadDataPort(SDH_Data_Cfg_Type *dataCfg)
{
    uint32_t tmpVal;
    uint32_t totalLen, recvLen = 0;

    totalLen = (dataCfg->blockCount * dataCfg->blockSize);
    tmpVal = BL_RD_REG(SDH_BASE, SDH_SD_TRANSFER_MODE);

    if (!BL_IS_REG_BIT_SET(tmpVal, SDH_DMA_EN)) {
        do {
            dataCfg->rxData[dataCfg->rxDataLen++] = BL_RD_REG(SDH_BASE, SDH_SD_BUFFER_DATA_PORT_0);
            recvLen += 4;
        } while (recvLen < totalLen);
    }

    return recvLen;
}

/****************************************************************************/ /**
 * @brief  SDH read data port
 *
 * @param  dataCfg: Transfer data config pointer
 *
 * @return Read length
 *
*******************************************************************************/
SDH_Stat_Type SDH_ReadDataPortBlock(SDH_Data_Cfg_Type *dataCfg)
{
    uint32_t intStatus = 0U;
    SDH_Stat_Type error = SDH_STAT_SUCCESS;

    /* Make sure the buffer size is 4 byte aligned */
    if (dataCfg->blockSize % sizeof(uint32_t) != 0U) {
        dataCfg->blockSize += sizeof(uint32_t) - (dataCfg->blockSize % sizeof(uint32_t));
    }

    while (!(intStatus & (SDH_INT_BUFFER_READ_READY | SDH_INT_DATA_ERRORS | SDH_INT_TUNE_ERROR))) {
        intStatus = SDH_GetIntStatus();
    }

    /* during std tuning process, software do not need to read data, but wait BRR is enough */
    if ((dataCfg->dataType == SDH_TRANS_DATA_TUNING) && (intStatus & SDH_INT_BUFFER_READ_READY)) {
        SDH_ClearIntStatus(SDH_INT_BUFFER_READ_READY);
        return SDH_STAT_SUCCESS;
    } else if ((intStatus & SDH_INT_TUNE_ERROR) != 0U) {
        SDH_ClearIntStatus(SDH_INT_TUNE_ERROR);
        /* if tuning error occur ,return directly */
        error = SDH_STAT_TUNE_ERROR;
    } else if ((intStatus & SDH_INT_DATA_ERRORS) != 0U) {
        if (!(dataCfg->enableIgnoreError)) {
            error = SDH_STAT_RECV_DATA_FAIL;
        }

        /* clear data error flag */
        SDH_ClearIntStatus(SDH_INT_DATA_ERRORS);
    }

    if (error == SDH_STAT_SUCCESS) {
        SDH_ReadDataPort(dataCfg);
        /* clear buffer read ready */
        SDH_ClearIntStatus(SDH_INT_BUFFER_READ_READY);
        intStatus = 0U;
    }

    /* Clear data complete flag after the last read operation. */
    SDH_ClearIntStatus(SDH_INT_DATA_COMPLETED);

    return error;
}

/****************************************************************************/ /**
 * @brief  SDH write data port
 *
 * @param  dataCfg: Transfer data config pointer
 *
 * @return write length
 *
*******************************************************************************/
uint32_t SDH_WriteDataPort(SDH_Data_Cfg_Type *dataCfg)
{
    uint32_t tmpVal;

