ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sdh.c
    tmpVal = BL_RD_REG(SDH_BASE, SDH_SD_TRANSFER_MODE);

    if (!BL_IS_REG_BIT_SET(tmpVal, SDH_DMA_EN)) {
        BL_WR_REG(SDH_BASE, SDH_SD_BUFFER_DATA_PORT_0, dataCfg->txData[dataCfg->txDataLen++]);
    }

    return 4;
}

/****************************************************************************/ /**
 * @brief  SDH write data port
 *
 * @param  dataCfg: Transfer data config pointer
 *
 * @return Write length
 *
*******************************************************************************/
SDH_Stat_Type SDH_WriteDataPortBlock(SDH_Data_Cfg_Type *dataCfg)
{
    uint32_t totalLen;
    uint32_t txLen = 0U, intStatus = 0U;
    SDH_Stat_Type error = SDH_STAT_SUCCESS;

    /* Make sure the buffer size is 4 byte aligned */
    if (dataCfg->blockSize % sizeof(uint32_t) != 0U) {
        dataCfg->blockSize += sizeof(uint32_t) - (dataCfg->blockSize % sizeof(uint32_t));
    }

    totalLen = (dataCfg->blockCount * dataCfg->blockSize);

    while ((error == SDH_STAT_SUCCESS) && (txLen < totalLen)) {
        while (!(intStatus & (SDH_INT_BUFFER_WRITE_READY | SDH_INT_DATA_ERRORS | SDH_INT_TUNE_ERROR))) {
            intStatus = SDH_GetIntStatus();
        }

        if ((intStatus & SDH_INT_TUNE_ERROR) != 0U) {
            SDH_ClearIntStatus(SDH_INT_TUNE_ERROR);
            /* if tuning error occur ,return directly */
            error = SDH_STAT_TUNE_ERROR;
        } else if ((intStatus & SDH_INT_DATA_ERRORS) != 0U) {
            if (!(dataCfg->enableIgnoreError)) {
                error = SDH_STAT_RECV_DATA_FAIL;
            }

            /* clear data error flag */
            SDH_ClearIntStatus(SDH_INT_DATA_ERRORS);
        }

        if (error == SDH_STAT_SUCCESS) {
            txLen += SDH_WriteDataPort(dataCfg);
            /* clear buffer read ready */
            SDH_ClearIntStatus(SDH_INT_BUFFER_WRITE_READY);
            intStatus = 0U;
        }
    }

    while (!(intStatus & (SDH_INT_DATA_COMPLETED | SDH_INT_DATA_ERRORS))) {
        intStatus = SDH_GetIntStatus();
    }

    if ((intStatus & SDH_INT_DATA_ERRORS) != 0U) {
        if (!(dataCfg->enableIgnoreError)) {
            error = SDH_STAT_RECV_DATA_FAIL;
        }

        /* clear data error flag */
        SDH_ClearIntStatus(SDH_INT_DATA_ERRORS);
    }

    SDH_ClearIntStatus(SDH_INT_DATA_COMPLETED);

    return error;
}

/****************************************************************************/ /**
 * @brief  SDH send command
 *
 * @param  cmd: command config pointer
 *
 * @return None
 *
*******************************************************************************/
void SDH_SendCommand(SDH_CMD_Cfg_Type *cmd)
{
    uint32_t tmpVal;
    uint32_t flag = cmd->flag;
    //uint32_t flag = 0;

    tmpVal = BL_RD_REG(SDH_BASE, SDH_SD_PRESENT_STATE_1);

    if (((tmpVal & SDH_PRESENT_FLAG_CMD_INHBIT) == 0U) && (cmd->type != SDH_CMD_EMPTY)) {
        /* Define the flag corresponding to each response type. */
        switch (cmd->respType) {
            case SDH_RESP_NONE:
                break;

            case SDH_RESP_R1: /* Response 1 */
            case SDH_RESP_R5: /* Response 5 */
            case SDH_RESP_R6: /* Response 6 */
            case SDH_RESP_R7: /* Response 7 */
                flag |= (SDH_TRANS_FLAG_RESP_48BITS | SDH_TRANS_FLAG_EN_CRC_CHECK | SDH_TRANS_FLAG_EN_INDEX_CHECK);
                break;

            case SDH_RESP_R1B: /* Response 1 with busy */
            case SDH_RESP_R5B: /* Response 5 with busy */
                flag |= (SDH_TRANS_FLAG_RESP_48BITS_WITH_BUSY | SDH_TRANS_FLAG_EN_CRC_CHECK | SDH_TRANS_FLAG_EN_INDEX_CHECK);
                break;

            case SDH_RESP_R2: /* Response 2 */
                flag |= (SDH_TRANS_FLAG_RESP_136BITS | SDH_TRANS_FLAG_EN_CRC_CHECK);
                break;

            case SDH_RESP_R3: /* Response 3 */
            case SDH_RESP_R4: /* Response 4 */
                flag |= (SDH_TRANS_FLAG_RESP_48BITS);
                break;

            default:
                break;
        }

        /* Config command index */
        tmpVal = flag >> 16;
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_CMD_TYPE, cmd->type);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_CMD_INDEX, cmd->index);

        /* Config command argument */
        BL_WR_REG(SDH_BASE, SDH_SD_ARG_LOW, cmd->argument);

        /* Config command index */
        BL_WR_REG16(SDH_BASE, SDH_SD_CMD, tmpVal);
    }

    /* FIXME:how to enable again */
    if (cmd->type == SDH_CMD_EMPTY) {
        SDH_DisableIntSource(SDH_INT_CMD_COMPLETED);
    }
}
/****************************************************************************/ /**
 * @brief  SDH wait command send done
 *
 * @param  cmd: Command config pointer
 *
 * @return Command deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_WaitCommandDone(SDH_CMD_Cfg_Type *cmd)
{
    uint32_t intStatus = 0U;
    SDH_Stat_Type stat = SDH_STAT_SUCCESS;

    /* Wait command complete or encounters error. */
    while (!(intStatus & (SDH_INT_CMD_COMPLETED | SDH_INT_CMD_ERRORS | SDH_INT_TUNE_ERROR))) {
        intStatus = SDH_GetIntStatus();
    }

    if ((intStatus & SDH_INT_TUNE_ERROR) != 0U) {
        stat = SDH_STAT_TUNE_ERROR;
    } else if ((intStatus & SDH_INT_CMD_ERRORS) != 0U) {
        stat = SDH_STAT_SEND_CMD_FAIL;
    }

    /* Receive response when command completes successfully. */
    if (stat == SDH_STAT_SUCCESS) {
        stat = SDH_GetCmdResp(cmd);
    }

    SDH_ClearIntStatus(SDH_INT_CMD_COMPLETED | SDH_INT_CMD_ERRORS | SDH_INT_TUNE_ERROR);

    return stat;
}

/****************************************************************************/ /**
 * @brief  SDH transfer data
 *
 * @param  dataCfg: Data config pointer
 * @param  enDMA: Whether enable DMA
 *
 * @return command deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_TransferDataBlocking(SDH_Data_Cfg_Type *dataCfg, uint8_t enDMA)
{
    SDH_Stat_Type stat = SDH_STAT_SUCCESS;
    uint32_t intStatus = 0U;

    if (enDMA) {
        /* Wait dataCfg complete or encounters error. */
        while (!(intStatus & (SDH_INT_DATA_COMPLETED | SDH_INT_DATA_ERRORS |
                              SDH_INT_DMA_ERROR | SDH_INT_TUNE_ERROR))) {
            intStatus = SDH_GetIntStatus();
        }

        if ((intStatus & SDH_INT_TUNE_ERROR) != 0U) {
            stat = SDH_STAT_TUNE_ERROR;
        } else if ((intStatus & (SDH_INT_DATA_ERRORS | SDH_INT_DMA_ERROR)) != 0U) {
            if ((!(dataCfg->enableIgnoreError)) || (intStatus & SDH_INT_DATA_TIMEOUT)) {
                stat = SDH_STAT_SEND_DATA_FAIL;
            }
        }

        /* load dummy data */
        if ((dataCfg->dataType == SDH_TRANS_DATA_BOOT_CONT) && (stat == SDH_STAT_SUCCESS)) {
            *(dataCfg->rxData) = bootDummy;
        }

        SDH_ClearIntStatus(SDH_INT_DATA_COMPLETED | SDH_INT_DATA_ERRORS |
                           SDH_INT_DMA_ERROR | SDH_INT_TUNE_ERROR);
    } else {
        if (dataCfg->rxData) {
            stat = SDH_ReadDataPortBlock(dataCfg);
        } else {
            stat = SDH_WriteDataPortBlock(dataCfg);
        }
    }

