ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sdh.c
    /* Set DMA burst size and FIFO threshold */
    tmpVal = BL_RD_REG16(SDH_BASE, SDH_SD_CLOCK_AND_BURST_SIZE_SETUP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_DMA_SIZE, dmaCfg->fifoThreshold);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SDH_BRST_SIZE, dmaCfg->burstSize);
    BL_WR_REG16(SDH_BASE, SDH_SD_CLOCK_AND_BURST_SIZE_SETUP, tmpVal);

    return SDH_STAT_SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SDH create DMA entries according to DMA config
 *
 * @param  dmaCfg: DMA config pointer
 * @param  dataCfg: Data config pointer
 * @param  flag: ADMA create entries flag
 *
 * @return Create entries result
 *
*******************************************************************************/
SDH_Stat_Type SDH_CreateAdmaEntryConfig(SDH_DMA_Cfg_Type *dmaCfg, SDH_Data_Cfg_Type *dataCfg, SDH_ADMA_Flag_Type flag)
{
    SDH_Stat_Type stat = SDH_STAT_SUCCESS;

    /* TODO:align */
    uint32_t bootDummyOffset = (dataCfg->dataType == SDH_TRANS_DATA_BOOT_CONT ? sizeof(uint32_t) : 0);
    const uint32_t *data = (const uint32_t *)((dataCfg->rxData == NULL) ? dataCfg->txData : dataCfg->rxData);
    uint32_t dataLen = dataCfg->blockSize * dataCfg->blockCount;

    data += bootDummyOffset;
    dataLen -= bootDummyOffset;

    switch (dmaCfg->dmaMode) {
        case SDH_DMA_MODE_SIMPLE:
            stat = SDH_STAT_SUCCESS;
            break;

        case SDH_DMA_MODE_ADMA1:
            stat = SDH_CreateADMA1Descriptor(dmaCfg->admaEntries, dmaCfg->maxEntries, data, dataLen, flag);
            break;

        case SDH_DMA_MODE_ADMA2:
            stat = SDH_CreateADMA2Descriptor((SDH_ADMA2_Desc_Type *)dmaCfg->admaEntries, dmaCfg->maxEntries, data, dataLen, flag);
            break;

        default:
            return SDH_STAT_SEND_DATA_FAIL;
    }

    /* For internal dma, internal DMA configurations should not update the configurations when continous transfer the
	 * boot data, only the DMA descriptor need update */
    if ((stat == SDH_STAT_SUCCESS) && (dataCfg->dataType != SDH_TRANS_DATA_BOOT_CONT)) {
        stat = SDH_SetInternalDmaConfig(dmaCfg, data, dataCfg->enableAutoCommand23);
    }

    return stat;
}

/****************************************************************************/ /**
 * @brief  SDH transfer data in blocking way
 *
 * @param  dmaCfg: DMA config pointer
 * @param  transfer: Transfer config pointer
 *
 * @return Transfer deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_TransferBlocking(SDH_DMA_Cfg_Type *dmaCfg, SDH_Trans_Cfg_Type *transfer)
{
    SDH_Stat_Type stat = SDH_STAT_SUCCESS;
    SDH_CMD_Cfg_Type *cmdCfg = transfer->cmdCfg;
    SDH_Data_Cfg_Type *dataCfg = transfer->dataCfg;
    uint32_t intStatus;
    uint8_t enDMA = 1;
    uint8_t executeTuning = ((dataCfg == NULL) ? 0 : dataCfg->dataType == SDH_TRANS_DATA_TUNING);
    //volatile uint32_t tmp;
    /* Check re-tuning request */
    intStatus = SDH_GetIntStatus();

    if ((intStatus & SDH_INT_RETUNE_EVENT) != 0U) {
        SDH_ClearIntStatus(SDH_INT_RETUNE_EVENT);
        return SDH_STAT_RETUNE_REQ;
    }

    /* Update ADMA descriptor table according to different DMA mode(simple DMA, ADMA1, ADMA2).*/
    if ((dataCfg != NULL) && (dmaCfg != NULL) && (!executeTuning)) {
        stat = SDH_CreateAdmaEntryConfig(dmaCfg, dataCfg, (dataCfg->dataType & SDH_TRANS_DATA_BOOT) ? SDH_ADMA_FLAG_MULTI_DESC : SDH_ADMA_FLAG_SINGLE_DESC);
    }

    /* If the DMA desciptor configure fail or not needed , disable it */
    if ((stat != SDH_STAT_SUCCESS) || (dmaCfg == NULL)) {
        enDMA = 0;
        /* Disable DMA, using polling mode in this situation */
        SDH_DisableDMA();
    }

    /* Config the data transfer parameter */
    stat = SDH_ConfigDataTranfer(dataCfg);

    if (SDH_STAT_SUCCESS != stat) {
        return stat;
    }

    /* Send command first */
    if (dataCfg != NULL) {
        cmdCfg->flag = SDH_TRANS_FLAG_DATA_PRESENT;
    } else {
        cmdCfg->flag = 0;
    }

    SDH_SendCommand(cmdCfg);

    /* Wait command done */
    if ((dataCfg == NULL) || (dataCfg->dataType == SDH_TRANS_DATA_NORMAL)) {
        stat = SDH_WaitCommandDone(cmdCfg);
    }

    /*
	tmp = BL_RD_REG16(SDH_BASE,SDH_SD_ADMA_ERROR_STATUS);
	bflb_platform_printf("SDH_SD_ADMA_ERROR_STATUS->0x%x!\r\n",tmp);
	tmp = BL_RD_REG16(SDH_BASE,SDH_SD_AUTO_CMD12_ERROR_STATUS);
	*/

    /* Wait for transferring data finish */
    if ((dataCfg != NULL) && (stat == SDH_STAT_SUCCESS)) {
        stat = SDH_TransferDataBlocking(dataCfg, enDMA);
    }

    return stat;
}

/****************************************************************************/ /**
 * @brief  SDH transfer data in blocking way
 *
 * @param  handle: SDH handler
 * @param  dmaCfg: DMA config pointer
 * @param  transfer: Transfer config pointer
 *
 * @return Transfer deal status
 *
*******************************************************************************/
SDH_Stat_Type SDH_TransferNonBlocking(SDH_DMA_Cfg_Type *dmaCfg, SDH_Trans_Cfg_Type *transfer)
{
    SDH_Stat_Type stat = SDH_STAT_SUCCESS;
    SDH_CMD_Cfg_Type *cmdCfg = transfer->cmdCfg;
    SDH_Data_Cfg_Type *dataCfg = transfer->dataCfg;
    uint32_t intStatus;
    uint8_t executeTuning = ((dataCfg == NULL) ? 0 : dataCfg->dataType == SDH_TRANS_DATA_TUNING);

    /* Check re-tuning request */
    intStatus = SDH_GetIntStatus();

    if ((intStatus & SDH_INT_RETUNE_EVENT) != 0U) {
        SDH_ClearIntStatus(SDH_INT_RETUNE_EVENT);
        return SDH_STAT_RETUNE_REQ;
    }

    /* Update ADMA descriptor table according to different DMA mode(simple DMA, ADMA1, ADMA2).*/
    if ((dataCfg != NULL) && (dmaCfg != NULL) && (!executeTuning)) {
        stat = SDH_CreateAdmaEntryConfig(dmaCfg, dataCfg, (dataCfg->dataType & SDH_TRANS_DATA_BOOT) ? SDH_ADMA_FLAG_MULTI_DESC : SDH_ADMA_FLAG_SINGLE_DESC);
    }

    /* If the DMA desciptor configure fail or not needed , disable it */
    if (stat != SDH_STAT_SUCCESS) {
        /* Disable DMA, using polling mode in this situation */
        //SDH_DisableDMA();
        return stat;
    }

